In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South'] * 5,
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice'] * 5
}


df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [3]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    337     80   John  January      Q1
1  2023-01-02       B   West    538     28   Mary  January      Q1
2  2023-01-03       C  North    213     79    Bob  January      Q1
3  2023-01-04       D  South    680     43  Alice  January      Q1
4  2023-01-05       A   East    509     39   John  January      Q1
5  2023-01-06       B   West    843     98   Mary  January      Q1
6  2023-01-07       C  North    766     24    Bob  January      Q1
7  2023-01-08       D  South    351     27  Alice  January      Q1
8  2023-01-09       A   East    165     23   John  January      Q1
9  2023-01-10       B   West    875     20   Mary  January      Q1
10 2023-01-11       C  North    321     83    Bob  January      Q1
11 2023-01-12       D  South    774     30  Alice  January      Q1
12 2023-01-13       A   East    598     55   John  January      Q1
13 2023-01-14       B   West    658     99   Mary  January      Q1
14 2023-01-15       C  North    582     67    Bob  January      Q1
15 2023-01-16       D  South    753     94  Alice  January      Q1
16 2023-01-17       A   East    653     74   John  January      Q1
17 2023-01-18       B   West    985     36   Mary  January      Q1
18 2023-01-19       C  North    998     22    Bob  January      Q1
19 2023-01-20       D  South    106     46  Alice  January      Q1

In [6]:
pd.pivot_table(df,values = "Sales", index = 'Region', columns='Product', aggfunc = 'median')

Product      A      B      C      D
Region
East     509.0    NaN    NaN    NaN
North      NaN    NaN  582.0    NaN
South      NaN    NaN    NaN  680.0
West       NaN  843.0    NaN    NaN

In [7]:
pivot2 = pd.pivot_table(df,values = ["Sales", "Units"], index = 'Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     452.4    NaN    NaN    NaN  54.2   NaN   NaN   NaN
North      NaN    NaN  576.0    NaN   NaN   NaN  55.0   NaN
South      NaN    NaN    NaN  532.8   NaN   NaN   NaN  48.0
West       NaN  779.8    NaN    NaN   NaN  56.2   NaN   NaN

In [8]:
#cross tables

In [9]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0